Spruce up README and add dashboard preview
